================================================================================
Simple placeholder
================================================================================

simple: "Hello {name}!"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (placeholder
        (identifier)))))

================================================================================
Simple text only
================================================================================

greeting: "Hello world!"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string)))

================================================================================
Comment
================================================================================

// This is a comment
greeting: "Hello!"

--------------------------------------------------------------------------------

(source_file
  (comment)
  (key
    (identifier))
  (value
    (quoted_string)))

================================================================================
Multiple entries with comma
================================================================================

greeting: "Hello!",
farewell: "Goodbye!"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string))
  (key
    (identifier))
  (value
    (quoted_string)))

================================================================================
Number formatting with skeleton
================================================================================

price: "Cost: {amount, number, ::currency/USD}"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (complex_message
        (identifier)
        (skeleton_format
          (skeleton_pattern))))))

================================================================================
Date formatting with skeleton
================================================================================

birthday: "Born on {date, date, ::MMM d, y}"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (complex_message
        (identifier)
        (skeleton_format
          (skeleton_pattern))))))

================================================================================
Time formatting with skeleton
================================================================================

meeting: "Meeting at {time, time, ::h:mm a}"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (complex_message
        (identifier)
        (skeleton_format
          (skeleton_pattern))))))

================================================================================
Number formatting with style
================================================================================

amount: "Total: {value, number, currency}"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (complex_message
        (identifier)
        (style_format)))))

================================================================================
Simple plural
================================================================================

items: "{count, plural, =0 {no items} other {# items}}"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (complex_message
        (selector
          (identifier)
          (plural)
          (plural_rules
            (plural_case
              (plural_key
                (number))
              (case_body))
            (plural_case
              (plural_key)
              (case_body
                (pound_placeholder)))))))))

================================================================================
Simple select
================================================================================

gender: "{person, select, male {He} female {She} other {They}}"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (complex_message
        (selector
          (identifier)
          (select)
          (select_rules
            (select_case
              (select_key
                (identifier))
              (case_body))
            (select_case
              (select_key
                (identifier))
              (case_body))
            (select_case
              (select_key
                (identifier))
              (case_body))))))))

================================================================================
Template string
================================================================================

multiline: `Hello {name}!
Welcome back.`

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (template_string
      (placeholder
        (identifier)))))

================================================================================
Escaped characters
================================================================================

escaped: "Use '{' and '}' for braces, or '#' for pound"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (escaped_char
        (quoted_literal))
      (escaped_char
        (quoted_literal))
      (escaped_char
        (quoted_literal)))))

================================================================================
Apostrophe in text
================================================================================

possessive: "This is John's book"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string)))

================================================================================
Single quote at end
================================================================================

ending: "Hello {name}'"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (placeholder
        (identifier)))))

================================================================================
Mixed text and placeholders
================================================================================

message: "Hello {name}, you have {count} messages!"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (placeholder
        (identifier))
      (placeholder
        (identifier)))))

================================================================================
Empty quoted string
================================================================================

empty: ""

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string)))

================================================================================
Only placeholder
================================================================================

name: "{user}"

--------------------------------------------------------------------------------

(source_file
  (key
    (identifier))
  (value
    (quoted_string
      (placeholder
        (identifier)))))
